successxml.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v3="http://www.csapi.org/schema/parlayx/common/v3_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/send/v3_1/local">
	<soapenv:Header>
		<v3:RequestSOAPHeader>
			<spId>36</spId>
			<spPassword>96e79218965eb72c92a549dd5a330112</spPassword>
			<timeStamp></timeStamp>
			<serviceId>34</serviceId>
			<transEnd></transEnd>
			<FA></FA>
		</v3:RequestSOAPHeader>
	</soapenv:Header>
	<soapenv:Body>
		<loc:sendSms>
			<!--1 or more repetitions: -->
			<loc:addresses>tel:0775127975</loc:addresses>
			<loc:senderName>32329</loc:senderName>
			<loc:message>Test SMS Service</loc:message>
		</loc:sendSms>
	</soapenv:Body>
</soapenv:Envelope>
